using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;

namespace DataEntity
{
    /// <summary>
    /// 这个类本来是为了方便分类导出Excel而准备的，后来为了便于维护，我把表头信息写在xEqType.xml里了。这个类保留下来只是我懒得删，
    /// 觉得以后可能还会用上。但实际上应该用不上了。请不要在这里纠结。
    /// </summary>
    public class EqType
    {
        //土地、房屋及构筑物
         private string[] _estate={"财政编号","国标分类号","资产名称","使用状况","取得方式","取得日期","投入使用日期","价值类型",
                                 "价值","数量","计量单位","建筑/土地面积","产权形式","权属证号","发证日期","权属年限（月）",
                                 "权属证明","坐落位置","权属性质","自用面积","自用价值","建筑结构","备注"};

        //通用设备
         private string[] _commom ={"财政编号","国标分类号","资产名称","使用状况","数量","计量单位","使用方向","采购形式","取得方式",
                                   "取得日期","品牌","规格型号","价值类型","价值","使用人","使用部门","合同编号","发票号","投入使用日期",
                                   "存放地点","备注"};

        //车辆
         private string[] _car ={"财政编号","国标分类号","资产名称","使用状况","数量","使用方向","采购形式","取得方式","取得日期",
                                 "车辆用途","计量单位","品牌","规格型号","车辆产地","车牌号","排气量（L）","发动机号","合同编号",
                                 "发票号","价值类型","价值","使用部门","使用人","投入使用日期","编制情况","备注"};

        //专用设备
         private string[] _special ={"财政编号","国标分类号","资产名称","使用状况","数量","使用方向","采购形式","取得方式",
                                   "取得日期","品牌","规格型号","价值类型","价值","计量单位","使用人","使用部门","合同编号",
                                   "发票号","投入使用日期","存放地点","备注"};

        //文物和陈列品
         private string[] _relic ={"财政编号","国标分类号","资产名称","使用状况","数量","使用方向","采购形式","取得方式",
                                   "取得日期","价值类型","价值","计量单位","使用部门","投入使用日期","存放地点","文物等级","备注"};

        //图书、档案
         private string[] _book ={"财政编号","国标分类号","资产名称","使用状况","数量","计量单位","使用方向","采购形式","取得方式",
                                   "取得日期","价值类型","价值","使用人","使用部门","投入使用日期","存放地点","备注"};

        //家具、用具、装具及动植物
         private string[] _tool ={"财政编号","国标分类号","资产名称","使用状况","数量","计量单位","使用方向","采购形式","取得方式",
                                   "取得日期","品牌","价值类型","价值","使用人","使用部门","投入使用日期","存放地点","备注"};

        //无形资产
         private string[] _iasset ={"财政编号","国标分类号","资产名称","使用状况","取得方式","取得日期","计量单位","价值类型","价值",
                                    "规格型号","数量","存放地点","使用部门","使用人","注册登记机关","注册登记时间","专利号","批准文号",
                                    "管理机构","备注"};


         public string[] Estate
         {
             get { return _estate; }
         }

         public string[] Commom
         {
             get { return _commom; }
         }

         public string[] Car
         {
             get { return _car; }
         }

         public string[] Special
         {
             get { return _special; }
         }

         public string[] Relic
         {
             get { return _relic; }
         }

         public string[] Book
         {
             get { return _book; }
         }

         public string[] Tool
         {
             get { return _tool; }
         }

         public string[] Iasset
         {
             get { return _iasset; }
         }


    }
}
