@echo OFF
cls
echo -----------------------------------------------------
echo 将数据库连结至您的 SQL Server ... 请稍后...
echo -----------------------------------------------------
sqlcmd -E -S . -i C:\Solut_EquipentMgr_Data\BuidDatabase.sql
echo -----------------------------------------------------
echo 正在配置系统运行的数据库环境 请稍后...
echo -----------------------------------------------------
sqlcmd -E -S . -i C:\Solut_EquipentMgr_Data\KillProcessProcedure.sql
echo -----------------------------------------------------
echo 已完成系统数据库运行环境的配置操作
echo -----------------------------------------------------
echo 系统可以运行



